In [1]:
import numpy as n
import pandas as p

In [2]:
register = { 'reg_id': [1, 2, 3, 4, 5], 'name': ['Adi', 'Nurs', 'Mehmet', 'Diaz', 'Erjan']}

In [3]:
login = { 'log_id': [1, 2, 3, 4, 5], 'name': ['Sanat', 'Erjan', 'Adi', 'Adham', 'Nurs']}

In [4]:
reg = p.DataFrame(register)

In [5]:
log = p.DataFrame(login)

In [6]:
reg

   reg_id    name
0       1     Adi
1       2    Nurs
2       3  Mehmet
3       4    Diaz
4       5   Erjan

In [8]:
p.merge(reg,log, how='inner',on='name') # we connect two table inner join

   reg_id   name  log_id
0       1    Adi       3
1       2   Nurs       5
2       5  Erjan       2

In [ ]:
s